# SF Salaries Exercise

Welcome to a quick exercise for you to practice your pandas skills! We will be using the [SF Salaries Dataset](https://www.kaggle.com/kaggle/sf-salaries) from Kaggle! Just follow along and complete the tasks outlined in bold below. The tasks will get harder and harder as you go along.

** Import pandas as pd.**

In [54]:
import pandas as pd
import numpy as np

** Read Salaries.csv as a dataframe called sal.**

In [2]:
sal = pd.read_csv("../data/Salaries.csv")

C:\ProgramData\Anaconda3\lib\site-packages\IPython\core\interactiveshell.py:3444: DtypeWarning: Columns (3,4,5,6,12) have mixed types.Specify dtype option on import or set low_memory=False.
  exec(code_obj, self.user_global_ns, self.user_ns)

** Check the head of the DataFrame. **

In [3]:
sal.head()

,Id,EmployeeName,JobTitle,BasePay,OvertimePay,OtherPay,Benefits,TotalPay,TotalPayBenefits,Year,Notes,Agency,Status
0,1,NATHANIEL FORD,GENERAL MANAGER-METROPOLITAN TRANSIT AUTHORITY,167411.18,0.0,400184.25,NaN,567595.43,567595.43,2011,NaN,San Francisco,NaN
1,2,GARY JIMENEZ,CAPTAIN III (POLICE DEPARTMENT),155966.02,245131.88,137811.38,NaN,538909.28,538909.28,2011,NaN,San Francisco,NaN
2,3,ALBERT PARDINI,CAPTAIN III (POLICE DEPARTMENT),212739.13,106088.18,16452.6,NaN,335279.91,335279.91,2011,NaN,San Francisco,NaN
3,4,CHRISTOPHER CHONG,WIRE ROPE CABLE MAINTENANCE MECHANIC,77916.0,56120.71,198306.9,NaN,332343.61,332343.61,2011,NaN,San Francisco,NaN
4,5,PATRICK GARDNER,"DEPUTY CHIEF OF DEPARTMENT,(FIRE DEPARTMENT)",134401.6,9737.0,182234.59,NaN,326373.19,326373.19,2011,NaN,San Francisco,NaN

In [8]:
sal.tail()

,Id,EmployeeName,JobTitle,BasePay,OvertimePay,OtherPay,Benefits,TotalPay,TotalPayBenefits,Year,Notes,Agency,Status
148649,148650,Roy I Tillery,Custodian,0.00,0.00,0.00,0.00,0.00,0.00,2014,NaN,San Francisco,PT
148650,148651,Not provided,Not provided,Not Provided,Not Provided,Not Provided,Not Provided,0.00,0.00,2014,NaN,San Francisco,NaN
148651,148652,Not provided,Not provided,Not Provided,Not Provided,Not Provided,Not Provided,0.00,0.00,2014,NaN,San Francisco,NaN
148652,148653,Not provided,Not provided,Not Provided,Not Provided,Not Provided,Not Provided,0.00,0.00,2014,NaN,San Francisco,NaN
148653,148654,Joe Lopez,"Counselor, Log Cabin Ranch",0.00,0.00,-618.13,0.00,-618.13,-618.13,2014,NaN,San Francisco,PT

** Use the .info() method to find out how many entries there are.**

In [11]:
cols = ['BasePay', 'OvertimePay', 'OtherPay','Benefits']

In [68]:
sal[cols] = sal[cols].fillna(0.0)

In [70]:
sal['BasePay'] = sal['BasePay'].apply(lambda elem: 0.0 if elem=='Not Provided' else float(elem))

In [71]:
sal[cols[1]] = sal[cols[1]].apply(lambda elem: 0.0 if elem=='Not Provided' else float(elem))

In [72]:
sal[cols[2]] = sal[cols[2]].apply(lambda elem: 0.0 if elem=='Not Provided' else float(elem))

In [73]:
sal[cols[3]] = sal[cols[3]].apply(lambda elem: 0.0 if elem=='Not Provided' else float(elem))

In [75]:
sal.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 148654 entries, 0 to 148653
Data columns (total 13 columns):
 #   Column            Non-Null Count   Dtype
---  ------            --------------   -----
 0   Id                148654 non-null  int64
 1   EmployeeName      148654 non-null  object
 2   JobTitle          148654 non-null  object
 3   BasePay           148654 non-null  float64
 4   OvertimePay       148654 non-null  float64
 5   OtherPay          148654 non-null  float64
 6   Benefits          148654 non-null  float64
 7   TotalPay          148654 non-null  float64
 8   TotalPayBenefits  148654 non-null  float64
 9   Year              148654 non-null  int64
 10  Notes             0 non-null       float64
 11  Agency            148654 non-null  object
 12  Status            38119 non-null   object
dtypes: float64(7), int64(2), object(4)
memory usage: 14.7+ MB

**What is the average BasePay ?**

In [77]:
sal['BasePay'].mean()

66053.72928809702

** What is the highest amount of OvertimePay in the dataset ? **

In [78]:
sal['OvertimePay'].max()

245131.88

** What is the job title of  JOSEPH DRISCOLL ? Note: Use all caps, otherwise you may get an answer that doesn't match up (there is also a lowercase Joseph Driscoll). **

In [79]:
sal[sal['EmployeeName']=='JOSEPH DRISCOLL']['JobTitle']

24    CAPTAIN, FIRE SUPPRESSION
Name: JobTitle, dtype: object

** How much does JOSEPH DRISCOLL make (including benefits)? **

In [82]:
sal[sal['EmployeeName']=='JOSEPH DRISCOLL']['Benefits']

24    0.0
Name: Benefits, dtype: float64

In [81]:
sal[sal['EmployeeName']=='JOSEPH DRISCOLL']['TotalPay']

24    270324.91
Name: TotalPay, dtype: float64

In [80]:
sal[sal['EmployeeName']=='JOSEPH DRISCOLL']['TotalPayBenefits']

24    270324.91
Name: TotalPayBenefits, dtype: float64

** What is the name of highest paid person (including benefits)?**

In [83]:
sal[sal['TotalPayBenefits']==sal['TotalPayBenefits'].max()]['EmployeeName']

0    NATHANIEL FORD
Name: EmployeeName, dtype: object

In [84]:
sal[sal['TotalPayBenefits']==sal['TotalPayBenefits'].max()]

,Id,EmployeeName,JobTitle,BasePay,OvertimePay,OtherPay,Benefits,TotalPay,TotalPayBenefits,Year,Notes,Agency,Status
0,1,NATHANIEL FORD,GENERAL MANAGER-METROPOLITAN TRANSIT AUTHORITY,167411.18,0.0,400184.25,0.0,567595.43,567595.43,2011,NaN,San Francisco,NaN

** What is the name of lowest paid person (including benefits)? Do you notice something strange about how much he or she is paid?**

In [85]:
sal[sal['TotalPayBenefits']==sal['TotalPayBenefits'].min()]['EmployeeName']

148653    Joe Lopez
Name: EmployeeName, dtype: object

In [86]:
sal[sal['TotalPayBenefits']==sal['TotalPayBenefits'].min()]

,Id,EmployeeName,JobTitle,BasePay,OvertimePay,OtherPay,Benefits,TotalPay,TotalPayBenefits,Year,Notes,Agency,Status
148653,148654,Joe Lopez,"Counselor, Log Cabin Ranch",0.0,0.0,-618.13,0.0,-618.13,-618.13,2014,NaN,San Francisco,PT

** What was the average (mean) BasePay of all employees per year? (2011-2014) ? **

In [91]:
bp_2011 = sal[sal['Year'] == 2011]['BasePay'].mean()
bp_2011

63595.956516774524

In [95]:
req_df=sal.groupby('Year')

In [98]:
req_df.describe()

           Id                                                         \
        count      mean           std       min        25%       50%
Year
2011  36159.0   18080.0  10438.348528       1.0    9040.50   18080.0
2012  36766.0   54542.5  10613.574335   36160.0   45351.25   54542.5
2013  37606.0   91728.5  10856.061448   72926.0   82327.25   91728.5
2014  38123.0  129593.0  11005.306493  110532.0  120062.50  129593.0

                           BasePay                ... TotalPayBenefits  \
            75%       max    count          mean  ...              75%
Year                                              ...
2011   27119.50   36159.0  36159.0  63595.956517  ...      102512.6800
2012   63733.75   72925.0  36766.0  65436.406857  ...      142396.3325
2013  101129.75  110531.0  37606.0  68509.832156  ...      142793.6875
2014  139123.50  148654.0  38123.0  66557.437750  ...      142746.9500

                Notes
            max count mean std min 25% 50% 75% max
Year
2011  567595.43   0.0  NaN NaN NaN NaN NaN NaN NaN
2012  407274.78   0.0  NaN NaN NaN NaN NaN NaN NaN
2013  425815.28   0.0  NaN NaN NaN NaN NaN NaN NaN
2014  510732.68   0.0  NaN NaN NaN NaN NaN NaN NaN

[4 rows x 64 columns]

In [100]:
req_df['BasePay'].mean()

Year
2011    63595.956517
2012    65436.406857
2013    68509.832156
2014    66557.437750
Name: BasePay, dtype: float64

** How many unique job titles are there? **

In [105]:
len(sal['JobTitle'].unique())

2159

** What are the top 5 most common jobs? **

In [106]:
sal['JobTitle'].count()

148654

In [109]:
sal['JobTitle'].value_counts()

Transit Operator                                  7036
Special Nurse                                     4389
Registered Nurse                                  3736
Public Svc Aide-Public Works                      2518
Police Officer 3                                  2421
                                                  ...
CHIEF HOUSING INSPECTOR                              1
TRAFFIC SIGNAL OPERATOR                              1
COURT COMPUTER FACILITIES COORDINATOR                1
AUTOMOTIVE BODY AND FENDER WORKER SUPERVISOR I       1
VICTIM & WITNESS TECHNICIAN                          1
Name: JobTitle, Length: 2159, dtype: int64

In [110]:
sal['JobTitle'].value_counts().head(5)

Transit Operator                7036
Special Nurse                   4389
Registered Nurse                3736
Public Svc Aide-Public Works    2518
Police Officer 3                2421
Name: JobTitle, dtype: int64

** How many Job Titles were represented by only one person in 2013? (e.g. Job Titles with only one occurence in 2013?) **

In [112]:
sal[sal['Year']==2013]['JobTitle'].count()

37606

In [113]:
sal[sal['Year']==2013]['JobTitle'].value_counts()

Transit Operator                  2295
Special Nurse                     1445
Registered Nurse                  1231
Public Svc Aide-Public Works       859
Custodian                          789
                                  ...
Sr General Utility Mechanic          1
Sprv Adult Prob Ofc (SFERS)          1
Mayoral Staff XII                    1
Pr Investigator, Tax Collector       1
Senior Assessment Clerk              1
Name: JobTitle, Length: 1051, dtype: int64

In [116]:
sal[sal['Year']==2013]['JobTitle'].value_counts()==1

Transit Operator                  False
Special Nurse                     False
Registered Nurse                  False
Public Svc Aide-Public Works      False
Custodian                         False
                                  ...
Sr General Utility Mechanic        True
Sprv Adult Prob Ofc (SFERS)        True
Mayoral Staff XII                  True
Pr Investigator, Tax Collector     True
Senior Assessment Clerk            True
Name: JobTitle, Length: 1051, dtype: bool

In [115]:
np.sum(sal[sal['Year']==2013]['JobTitle'].value_counts()==1)

202

** How many people have the word Chief in their job title? (This is pretty tricky) **

In [117]:
sal['JobTitle'].apply(lambda elem: True if 'chief' in elem.lower() else False)

0         False
1         False
2         False
3         False
4          True
          ...
148649    False
148650    False
148651    False
148652    False
148653    False
Name: JobTitle, Length: 148654, dtype: bool

In [120]:
np.sum(sal['JobTitle'].apply(lambda elem: True if 'chief' in elem.lower() else False))

627

In [119]:
sal[sal['JobTitle'].apply(lambda elem: True if 'chief' in elem.lower() else False)].count()

Id                  627
EmployeeName        627
JobTitle            627
BasePay             627
OvertimePay         627
OtherPay            627
Benefits            627
TotalPay            627
TotalPayBenefits    627
Year                627
Notes                 0
Agency              627
Status              140
dtype: int64

** Bonus: Is there a correlation between length of the Job Title string and Salary? **

In [122]:
sal['TitleString'] = sal['JobTitle'].apply(len)

In [123]:
sal[['TitleString','TotalPay']].corr()

             TitleString  TotalPay
TitleString     1.000000 -0.015356
TotalPay       -0.015356  1.000000

In [124]:
sal[['TitleString','TotalPayBenefits']].corr()

                  TitleString  TotalPayBenefits
TitleString          1.000000         -0.036878
TotalPayBenefits    -0.036878          1.000000

# Completed!